index=esa (sourcetype=cisco:esa:textmail "Custom Log Entry" 
        OR sourcetype=cisco:esa:cef) earliest=-7d@d latest=now
| rex field=_raw "(?:MID\s|ESAMID=)(?<MID>\d+)"
| rex field=_raw "Custom Log Entry:\s*(?<signature>[^\r\n]+)"
| search signature="This is an external domain sent from an internal, sender"
| dedup MID
| table _time MID signature suser duser host