index=esa (sourcetype=cisco:esa:textmail "Custom Log Entry" 
        OR sourcetype=cisco:esa:cef) earliest=-7d@d latest=now
| rex field=_raw "(?:MID\s|ESAMID=)(?<MID>\d+)"
| rex field=_raw "Custom Log Entry:\s*(?<signature>[^\r\n]+)"
| search signature="This is an external domain sent from an internal, sender"
| dedup MID
| table _time MID signature suser duser host



index=esa (sourcetype=cisco:esa:textmail "Custom Log Entry" OR sourcetype=cisco:esa:cef) earliest=-7d@d latest=now
| rex field=_raw "(?:MID\s|ESAMID=)(?<mid>\d+)"
| eval is_text=if(sourcetype=="cisco:esa:textmail",1,0)
| rex field=_raw "Custom Log Entry:\s*(?<sig_tmp>[^\r\n]+)"
| eval signature=if(is_text==1, sig_tmp, null())
| rex field=_raw "src=(?<src>\d{1,3}(?:\.\d{1,3}){3})"
| stats values(signature) as signature values(src) as src by mid
| where signature="This is an external domain sent from an internal, sender" AND isnotnull(src)
| dedup mid
| table mid signature src


(index=esa (sourcetype=cisco:esa:textmail "Custom Log Entry") OR sourcetype=cisco:esa:cef)
earliest=-7d@d latest=now
| rex field=_raw "(?:MID\s|ESAMID=)(?<MID>\d+)"
| rex field=_raw "Custom Log Entry:\s*(?<signature>[^\r\n]+)"
| rex field=_raw "suser=(?<suser>[^\s]+)"
| search signature="This is an external domain sent from an internal sender"
| stats min(_time) as first_time
        values(signature) as signature
        values(suser) as suser
        values(host) as host
        by MID
| eval date=strftime(first_time,"%Y-%m-%d"), time=strftime(first_time,"%H:%M:%S")
| fields date time MID signature suser host
| sort - first_time